src/cf/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНормыБесплатногоХранения_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНормыБесплатногоХранения_уэ</Name>
			<Comment>(уэ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНормыРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНормыРасходаГСМ</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛинейнаяНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЕздку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЗапуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаИзменениеСобственногоВеса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОперацию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОтопитель</Name>
					<Comment>Норма на отопитель, кондиционер, климат-контроль</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемЛитры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемПроцентомОтБазовой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота7</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота9</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота10</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаТранспортнуюРаботу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаСпециальнаяНаМоточас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезоннаяНадбавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НадбавкаНаКондиционер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПростоиДляРасчетаНормыМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаБулиты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПредПЖД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>ГСМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаботаНаДвухВидахТопливаОдновременно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатКадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатКадроваяИсторияСотрудников</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНачислятьЗПВПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКласс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПозывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/уатДатыЗапретаИзменения/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Даты запрета изменения".
// Настройка переопределяемого модуля в конфигурации "УАТ: ПРОФ".
// 
// Реализация процедур и функций модуля ДатыЗапретаИзмененияПереопределяемый
// для поддержки библиотечного подхода разработки.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
	НастройкиРаботыИнтерфейса.ИспользоватьВнешнихПользователей = Ложь;
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.такАгентскийДоговор",                                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.такАрендаТС",                                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.такЗаказТакси",                                           "Дата", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНатурныйЛист",                                         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаявкаГУ12",                                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНакладнаяГУ27",                                        "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктОсмотраВагонов",                                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПровеска",                                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОпломбированиеВагонов",                                "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацияСВагонами",                                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатДислокацияВагонов",                                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСправкаНаВагон",                                       "Дата", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАвансовыйОтчет",                                       "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктКС3_стм",                                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктОтгрузки_уэ",                                       "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктПриемаПередачиТС",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктПриемки_уэ",                                        "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктСверкиВзаиморасчетов_уэ",                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатБилетныйЛист",                                         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводВЭксплуатациюТСиОборудования",                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводНачальныхДанныхПоАгрегатам",                       "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводНачальныхПоказаний",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводОстатков",                                         "Дата", "УправлениеАвтотранспортом", "Организация");        
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВводОстатковГСМ",                                      "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВзаимозачет"    ,                                      "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВнутреннееПеремещение",                                "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВозвратТоваров",                                       "Дата", "УправлениеАвтотранспортом", "Организация");          
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВыбытиеТСиОборудования",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВыдачаРасходныхМатериалов",                            "Дата", "УправлениеАвтотранспортом", "Организация");          
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатВыручкаВодителей",                                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатДиспозицияТС",                                         "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатДоверенность",                                         "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатДТП",                                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЖурналМедицинскогоОсмотраВодителей",                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС",         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЖурналУчетаПоказанийОдометра",                         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаказГрузоотправителя",                                "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаказПоставщику",                                      "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗакрытиеЗаявокНаРасходованиеСредств",                  "Дата", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗакрытиеЗаявокНаРемонты",                              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаправкаГСМ",                                          "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаявкаНаРасходованиеДС",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаявкаНаРемонт",                                       "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатИнвентаризацияАгрегатов",                              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатИнвентаризацияГСМвТС",                                 "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатИнвентаризацияТоваров",                                "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатКомандировкиОрганизаций",                              "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатКорректировкаДолга",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатКорректировкаЗаписейРегистров",                        "Дата", "УправлениеАвтотранспортом", "");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатКорректировкаИспользованияРаботникамиРабочегоВремени", "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатМаршрутныйЛист",                                       "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНачислениеЗарплаты",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНачислениеПремий",                                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатНачислениеУдержаний",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацииСАгрегатами",                                  "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацииСТехническимиЖидкостями",                      "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОперацияСГрузом_уэ",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОприходованиеТоваров",                                 "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОтклонениеГруза",                                      "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОтчетПоставщикаПЦ",                                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПакетСопроводительныхДокументов",                      "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПарковка",                                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПеремещениеАгрегатов",                                 "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПеремещениеТоваров",                                   "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПеремещениеТСиОборудования",                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПланированиеРаботыТС",                                 "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПлатежноеПоручениеВходящее",                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПлатежноеПоручениеИсходящее",                          "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПосадочнаяВедомость",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПоступлениеАгрегатов",                                 "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПоступлениеБилетов",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПоступлениеТоваровУслуг",                              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПриходныйКассовыйОрдер",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПрочиеДоходыРасходы",                                  "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПутевойЛист",                                          "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРазнарядка",                                           "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРаспределениеДоходовРасходов",                         "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРаспределениеРасходовБудущихПериодов",                 "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРассылкаЭлектронныхПисем_уэ",                          "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРасходныйКассовыйОрдер",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРеализацияУслуг",                                      "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРемонтныйЛист",                                        "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСливГСМ",                                              "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСписаниеАгрегатов",                                    "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСписаниеТоваров",                                      "Дата", "УправлениеАвтотранспортом", "Организация");  
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСчетНаОплатуПокупателю",                               "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСчетНаОплатуПоставщика",                               "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСчетФактураВыданный",                                  "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатТабельУчетаРабочегоВремени",                           "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатТТД",                                                  "Дата", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаСтатусовСопроводительныхДокументов",          "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаПрейскурантовТС",                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаТарифовЗП",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаТарифовСебестоимости_уэ",                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатЗаказПеревозчику_уэ",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатТендер_уэ",                                            "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатПотребностьВПеревозке_уэ",                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРекламация_уэ",                                        "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаСтатусаГруза_уэ",                             "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатУстановкаСтатусаПЛ",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатШтраф",                                                "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРеестрОплатыШтрафов",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОтчетСистемыПлатон",                                   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатОтчетСистемыАвтодор",                                  "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатАктСверкиСтраховыхСертификатов_уэ",                    "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатСтраховойСертификат_уэ",                               "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРасчетФактическихДанныхПоДолгосрочномуПланированию",   "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРасчетСводныхПараметровВыработки",                     "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатИзменениеCчетчиковТС",                                 "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатТехнологическийПутевойЛист",                           "Дата", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "Документ.уатРеестрПеревозок",                                      "Дата", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатАгрегатыТС",                         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатСведенияОТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатМестонахождениеТС",                  "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатНормыБесплатногоХранения_уэ",        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатНормыРасходаГСМ",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатНормыРасходаТехническихЖидкостей",   "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатПрейскурантыТС",                     "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатПрохождениеТО",                      "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатКадроваяИсторияСотрудников",         "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатСтатусыСопроводительныхДокументов",  "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатСчетчикиТС",                         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатТарифыСебестоимости_уэ",             "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатТарифыСотрудников",                  "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрСведений.уатЦеныНоменклатурыКонтрагентов",       "Период", "УправлениеАвтотранспортом", "");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.такВознаграждениеВодителей",              "Период", "УправлениеАвтотранспортом", "Организация"); 
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.такОборотыПоЗаказамТакси",                "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.такНахождениеВАренде",                    "Период", "УправлениеАвтотранспортом", "Организация");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатБилетыНаСкладах",                      "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВзаиморасчетыСКонтрагентами",          "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаАгрегатов",                   "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаПоМаршрутнымЛистам_уэ",       "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаСотрудников",                 "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыработкаТС",                          "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыручка",                              "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатВыставленныеУслуги",                   "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатГрузыКПеревозке_уэ",                   "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатДвижениеДС",                           "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатДоходы",                               "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЗаказыГрузоотправителей",              "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЗаявкиНаРасходованиеДС",               "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЗаявкиНаРемонт",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатИзносАгрегатов",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатНевыставленныеРекламации_уэ",          "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатНоменклатураТС",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоЗаправкамГСМ",                "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоМаршрутномуЛисту",            "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыПоОтчетамПоставщиковПЦ",        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыТЖнаТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиАгрегатов",                     "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиГрузовВКонтейнерах_уэ",         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиГрузовНаСкладеКомплектации_уэ", "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиГСМнаТС",                       "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиДС",                            "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиДСУПодотчетныхЛиц",             "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОстаткиТЖнаТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПартииТоваровНаСкладах",               "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПлановыеУслуги_уэ",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПланРаботыТС",                         "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатПредоставленныеУслуги",                "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРабочееВремяСотрудников",              "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРасходГСМнаТС",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРасшифровкаРасходаГСМнаТС",            "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРасходы",                              "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатРекламации_уэ",                        "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатСводныеПараметрыВыработки",            "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатСписаниеАгрегатов",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатФактРаботыТС",                         "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатФинансовыеРезультаты",                 "Период", "УправлениеАвтотранспортом", "Организация");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЭлементыКомплектации_уэ",              "Период", "УправлениеАвтотранспортом", "");
	
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатОборотыВагоновПоСтанции",              "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатФактПоЗаказамНаТС",                    "Период", "УправлениеАвтотранспортом", "");
	ДатыЗапретаДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.уатЭлементыКомплектации_уэ",              "Период", "УправлениеАвтотранспортом", "");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавление строки с учетом наличия в метаданных
//
Процедура ДатыЗапретаДобавитьСтроку(ИсточникиДанных, Таблица="", ПолеДаты="", Раздел="", ПолеОбъекта="") 
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(Таблица);
	
	Если МетаданныеОбъекта = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, Таблица, ПолеДаты, Раздел, ПолеОбъекта); 

КонецПроцедуры // ДатыЗапретаДобавитьСтроку()

#КонецОбласти
